'use strict';

const listImages = [
    {
        src: './серия4/заставканачальная.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена1.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена2.jpg',
        nameImg: 'Воздушный шар',
    },
        {
        src: './серия4/сцена3.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена4.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена5.jpg',
        nameImg: 'Воздушный шар',
    },
        {
        src: './серия4/сцена6.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена7.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена8.jpg',
        nameImg: 'Воздушный шар',
    },
        {
        src: './серия4/сцена9.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена10.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена11.jpg',
        nameImg: 'Воздушный шар',
    },
        {
        src: './серия4/сцена12.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена13.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена14.jpg',
        nameImg: 'Воздушный шар',
    },
        {
        src: './серия4/сцена15.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена16.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена17.jpg',
        nameImg: 'Воздушный шар',
    },
        {
        src: './серия4/сцена18.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена19.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена20.jpg',
        nameImg: 'Воздушный шар',
    },
        {
        src: './серия4/сцена21.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена22.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена23.jpg',
        nameImg: 'Воздушный шар',
    },
        {
        src: './серия4/сцена24.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена25.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена26.jpg',
        nameImg: 'Воздушный шар',
    },
        {
        src: './серия4/сцена27.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена28.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена29.jpg',
        nameImg: 'Воздушный шар',
    },
        {
        src: './серия4/сцена30.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена31.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена32.jpg',
        nameImg: 'Воздушный шар',
    },
        {
        src: './серия4/сцена33.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена34.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена35.jpg',
        nameImg: 'Воздушный шар',
    },
        {
        src: './серия4/сцена36.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена37.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена38.jpg',
        nameImg: 'Воздушный шар',
    },
        {
        src: './серия4/сцена39.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена40.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена41.jpg',
        nameImg: 'Воздушный шар',
    },
        {
        src: './серия4/сцена42.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена43.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена44.jpg',
        nameImg: 'Воздушный шар',
    },
        {
        src: './серия4/сцена45.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена46.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена47.jpg',
        nameImg: 'Воздушный шар',
    },
        {
        src: './серия4/сцена48.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена49.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена50.jpg',
        nameImg: 'Воздушный шар',
    },
        {
        src: './серия4/сцена51.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена52.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена53.jpg',
        nameImg: 'Воздушный шар',
    },
        {
        src: './серия4/сцена54.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена55.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена56.jpg',
        nameImg: 'Воздушный шар',
    },
        {
        src: './серия4/сцена57.jpg',
        nameImg: 'Воздушный р',
    },
    {
        src: './серия4/сцена58.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена59.jpg',
        nameImg: 'Воздушный шар',
    },
        {
        src: './серия4/сцена60.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена61.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена62.jpg',
        nameImg: 'Воздушный шар',
    },
        {
        src: './серия4/сцена63.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена64.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена65.jpg',
        nameImg: 'Воздушный шар',
    },
        {
        src: './серия4/сцена66.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена67.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена68.jpg',
        nameImg: 'Воздушный шар',
    },
        {
        src: './серия4/сцена69.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена70.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена71.jpg',
        nameImg: 'Воздушный шар',
    },
        {
        src: './серия4/сцена72.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена73.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена74.jpg',
        nameImg: 'Воздушный шар',
    },
        {
        src: './серия4/сцена75.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена76.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена77.jpg',
        nameImg: 'Воздушный шар',
    },
        {
        src: './серия4/сцена78.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена79.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена80.jpg',
        nameImg: 'Воздушный шар',
    },
        {
        src: './серия4/сцена81.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена82.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена83.jpg',
        nameImg: 'Воздушный шар',
    },
        {
        src: './серия4/сцена84.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена85.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена86.jpg',
        nameImg: 'Воздушный шар',
    },
        {
        src: './серия4/сцена87.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена88.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена89.jpg',
        nameImg: 'Воздушный шар',
    },
        {
        src: './серия4/сцена90.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена91.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена92.jpg',
        nameImg: 'Воздушный шар',
    },
        {
        src: './серия4/сцена93.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена94.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена95.jpg',
        nameImg: 'Воздушный шар',
    },
        {
        src: './серия4/сцена96.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена97.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена98.jpg',
        nameImg: 'Воздушный шар',
    },
        {
        src: './серия4/сцена99.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена100.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена101.png',
        nameImg: 'Воздушный шар',
    },
        {
        src: './серия4/сцена102.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена103.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена104.png',
        nameImg: 'Воздушный шар',
    },
        {
        src: './серия4/сцена105.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена106.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена107.png',
        nameImg: 'Воздушный шар',
    },
        {
        src: './серия4/сцена108.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/сцена109.png',
        nameImg: 'Воздушный шар',
    },
        {
        src: './серия4/бекстейдж6.jpg',
        nameImg: 'Воздушный шар',
    },
];

const img= document.querySelector('.dodo');
const button = document.querySelector('button');

const setImg = (currentDataImg) => {
    img.src = currentDataImg.src;
    img.alt = currentDataImg.nameImg;
}

setImg(listImages[0]);

button.addEventListener('click', onChangeImg);

let count = 0;

function onChangeImg() {
    count += 1;
    setImg(listImages[count]);
}