'use strict';

const listImages = [
    {
        src: './спецвыпуск/начсцена11.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена1.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена2.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена3перв.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена3.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена4.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена5.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена6.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена7.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена8.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена9.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена10.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена11.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена12.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена13.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена14.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена15.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена16.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена17.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена18.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена19.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена20.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена21.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена22.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена23.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена24.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена25.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена26.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена27.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена28.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена29.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена30.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена31.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена32.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена33.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена34.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена35.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена36.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена37.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена38.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена40.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена41.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена42.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена43.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './спецвыпуск/сцена44.png',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/бекстейдж6.jpg',
        nameImg: 'Воздушный шар',
    },
];

const img= document.querySelector('.dodo');
const button = document.querySelector('button');

const setImg = (currentDataImg) => {
    img.src = currentDataImg.src;
    img.alt = currentDataImg.nameImg;
}

setImg(listImages[0]);

button.addEventListener('click', onChangeImg);

let count = 0;

function onChangeImg() {
    count += 1;
    setImg(listImages[count]);
}