'use strict';

const listImages = [
    {
        src: './серия3/заставканач1.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/сцена1.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/сцена2.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/сцена3.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/сцена4.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/сцена5.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/сцена6.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/сцена7.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/сцена8.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/сцена9.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия10.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия11.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия12.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия13.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия14.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия15.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия16.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия17.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия18.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия19.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия20.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия21.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия22.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия23.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия24.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия25.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия26.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия27.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия28.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия29.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия30.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия31.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия32.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия33.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия34.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия35.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия36.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия37.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия38.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия39.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия40.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия41.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия42.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия43.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия44.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия45.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия46.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия47.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия48.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия49.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия50.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия51.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия52.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия53.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия54.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия55.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия56.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия57.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия58.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия59.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия60.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия61.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия62.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия63.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия64.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия65.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия66.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия67.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия68.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия69.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия70.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия71.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия72.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия73.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия74.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия75.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия76.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия77.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия78.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия79.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия80.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия81.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия82.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия83.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия84.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия85.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия86.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия87.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия88.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия89.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия90.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия91.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия92.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия93.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия94.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия95.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия96.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия97.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия98.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия99.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия100.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия101.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия102.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия103.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия104.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия105.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия106.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия107.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия108.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия109.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия110.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия111.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия112.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия113.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия114.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия115.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия116.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия117.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия118.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия119.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия3/серия120.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/бекстейдж6.jpg',
        nameImg: 'Воздушный шар',
    },
];

const img= document.querySelector('.dodo');
const button = document.querySelector('button');

const setImg = (currentDataImg) => {
    img.src = currentDataImg.src;
    img.alt = currentDataImg.nameImg;
}

setImg(listImages[0]);

button.addEventListener('click', onChangeImg);

let count = 0;

function onChangeImg() {
    count += 1;
    setImg(listImages[count]);
}