'use strict';

const listImages = [
    {
        src: './csenes/заставка1.0.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена1.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена2.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена3.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена4.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена5.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена6.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена7.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена8.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена9.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена10.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена11.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена12.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена13.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена14.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена15.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена16.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена17.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена18.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена19.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена20.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена21.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена22.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена23.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена24.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена25.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена26.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена27.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена28.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена29.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена30.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена31.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена32.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена33.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена34.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена35.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена36.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена37.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена38.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена39.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена40.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена41.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена42.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена43.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена44.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена45.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена46.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена47.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена48.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена49.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена50.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена51.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена52.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена53.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена54.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена545.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена55.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена56.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена57.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена58.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена59.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена60.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена61.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена62.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена63.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена64.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена65.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена66.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена67.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена68.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена69.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена70.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена71.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена72.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена73.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена74.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена75.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена76.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена77.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена78.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена79.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена80.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена81.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена82.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена83.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена84.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена85.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена86.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена86.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена87.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена88.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена89.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена90.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена91.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена92.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена93.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена94.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена95.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена96.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена97.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена98.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена99.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена100.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена101.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена102.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена103.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена104.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена105.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена106.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена107.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена108.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена109.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена110.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена111.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена112.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена113.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена114.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия2/сцена115.jpg',
        nameImg: 'Воздушный шар',
    },
    {
        src: './серия4/бекстейдж6.jpg',
        nameImg: 'Воздушный шар',
    },
];

const img= document.querySelector('.dodo');
const button = document.querySelector('button');

const setImg = (currentDataImg) => {
    img.src = currentDataImg.src;
    img.alt = currentDataImg.nameImg;
}

setImg(listImages[0]);

button.addEventListener('click', onChangeImg);

let count = 0;

function onChangeImg() {
    count += 1;
    setImg(listImages[count]);
}